load/artillery.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up"
    - duration: 120
      arrivalRate: 3
      name: "Sustained load"

scenarios:
  - name: "Complete Quiz Flow"
    weight: 100
    flow:
      - post:
          url: "/api/user/start"
          json:
            email: "test-{{ $randomString() }}@example.com"
          capture:
            - json: "$.sessionId"
              as: "sessionId"
      - loop:
          - post:
              url: "/api/quiz/save"
              json:
                sessionId: "{{ sessionId }}"
                questionId: "{{ $loopCount }}"
                answers: ["{{ $randomInt(1, 6) }}"]
          count: 8
      - post:
          url: "/api/quiz/grade"
          json:
            sessionId: "{{ sessionId }}"
          expect:
            - statusCode: 200
            - hasProperty: "resultId"